In [7]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

%matplotlib inline
import matplotlib.pyplot as plt
pd.options.display.mpl_style = 'default'

In [68]:
test = pd.read_csv('test.csv')
test.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [12]:
train = pd.read_csv('train.csv')
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S

Intro to how to make Frequency Tables in Pandas:
http://stackoverflow.com/questions/15589354/frequency-tables-in-pandas-like-plyr-in-r

In [60]:
def Survivors(x):
    return pd.Series({'All': len(x['PassengerId']), 
                      'Survived': sum(x['Survived'] == 1),
                      'Survival%': (100 * sum(x['Survived'] == 1) / len(x['PassengerId']))})

train.groupby('Sex').apply(Survivors)

        All  Survival%  Survived
Sex
female  314  74.203822       233
male    577  18.890815       109

In [45]:
sum(train[((train.Age >=18) & (train.Survived ==1))]['Survived'])

229

Create a new column Child in the train data frame
NA if the passenger's age is NA, 
1 when the passenger is < 18 years 
0 when the passenger is >= 18 years.

In [59]:
train['Child'] = 0
adult = train['Age'] >= 18
child = train['Age'] < 18
nans = train['Age'].isnull()
train.loc[child, 'Child'] = 1
train.loc[adult, 'Child'] = 0
train.loc[nans, 'Child'] = np.NaN

train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Child
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [61]:
train.groupby('Child').apply(Survivors)

       All  Survival%  Survived
Child
0      601  38.103161       229
1      113  53.982301        61

Females had over 50% chance of surviving and males less than 50%. Use this information for your first prediction: 

all females in the test set survive and all males in the test set die.

In [69]:
male = (test['Sex'] == 'male')
nans = test['Sex'].isnull()
test.loc[male, 'Survived'] = 1
test.loc[~male, 'Survived'] = 0
test.loc[nans, 'Survived'] = np.NaN
test.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0

In [4]:
# for algorithms that only support binary features - Male = yes/no female = yes/no
def cat_to_num(data):
    categories = unique(data)
    features = []
    for category in categories:
        binary = (data == category)
        features.append(binary.astype("int"))
    return features

In [1]:
y2 = 665
y1 = 668
print(((y2 - y1) / y1) * 100)

-0.4491017964071856